app/controllers/activities_controller.rb

  def create
    @activity = Activity.new(params[:activity])

    respond_to do |format|
      if @activity.save
---
INSERT INTO "activities" ("name", "average_hr", "updated_at", "type", "start_time", "distance", "end_time", "created_at") VALUES('Test activity', 156, '2009-01-14 19:50:21', NULL, '2009-01-13 19:49:00', NULL, '2009-01-14 19:49:00', '2009-01-14 19:50:21')

  def find_activity
    @activity = current_user.activities.find(params[:id])
---
SELECT * FROM "activities" WHERE ("activities"."id" = 1)

  def load_chart
    @activity = Activity.find(params[:id])

    hr_series = []
    time_series = []
    c = 1
    @activity.trackpoints.each do |a|
---
SELECT * FROM "activities"
SELECT * FROM "trackpoints" WHERE ("trackpoints".activity_id = 1)