app/controllers/trackpoints_controller.rb

SELECT * FROM "activities" WHERE ("activities"."id" = 1)
---
  def index
    @activity = Activity.find(params[:activity_id])

SELECT * FROM "activities" WHERE ("activities"."id" = 1)
SELECT * FROM "trackpoints" WHERE ("trackpoints"."id" = 12)
---
  def show
    @activity = Activity.find(params[:activity_id])
    @trackpoint = Trackpoint.find(params[:id])

SELECT * FROM "activities" WHERE ("activities"."id" = 1)
---
  def new
    @activity = Activity.find(params[:activity_id])

SELECT * FROM "activities" WHERE ("activities"."id" = 1)
SELECT * FROM "trackpoints" WHERE ("trackpoints"."id" = 5)
---
  def edit
    @activity = Activity.find(params[:activity_id])
    @trackpoint = Trackpoint.find(params[:id])

SELECT * FROM "activities" WHERE ("activities"."id" = 1)
INSERT INTO "trackpoints" ("longitutde", "latitude", "updated_at", "activity_id", "heart_rate", "created_at") VALUES(NULL, 0.0, '2009-01-14 19:07:44', 1, 123, '2009-01-14 19:07:44')
---
  def create
    @activity = Activity.find(params[:activity_id])
    @trackpoint = @activity.trackpoints.build(params[:trackpoint])
    if @trackpoint.save